app/controllers/api_controller.rb

INSERT INTO "scores" ("created_at", "name", "scoring", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 18 Jan 2014 17:44:33 UTC +00:00], ["name", "asda"], ["scoring", 123], ["updated_at", Sat, 18 Jan 2014 17:44:33 UTC +00:00]]
---
  def NewScoring
   Score.create(name: params[:name], scoring: params[:scoring])