app/controllers/pages_controller.rb

  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("content", "created_at", "name", "permalink", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "sad"], ["created_at", Sun, 19 Jan 2014 19:12:42 UTC +00:00], ["name", "Whatevah"], ["permalink", "asd"], ["updated_at", Sun, 19 Jan 2014 19:12:42 UTC +00:00]]

  def destroy
    @page.destroy
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 1]]