app/views/layouts/_header.html.erb

        <ul class="nav navbar-nav meniu">
      	  <% Page.all.each do |page| %>
---
SELECT "pages".* FROM "pages"